test/request.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soap:Header/>
<soap:Body>
    <FECAESolicitar xmlns="http://ar.gov.afip.dif.FEV1/">
    <Auth><Token>PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiIHN0YW5kYWxvbmU9InllcyI/Pgo8c3NvIHZlcnNpb249IjIuMCI+CiAgICA8aWQgdW5pcXVlX2lkPSI0MDMwMDM3OTY2IiBzcmM9IkNOPXdzYWFob21vLCBPPUFGSVAsIEM9QVIsIFNFUklBTE5VTUJFUj1DVUlUIDMzNjkzNDUwMjM5IiBnZW5fdGltZT0iMTQzNTg1MTUyOSIgZXhwX3RpbWU9IjE0MzU4OTQ3ODkiIGRzdD0iQ049d3NmZSwgTz1BRklQLCBDPUFSIi8+CiAgICA8b3BlcmF0aW9uIHZhbHVlPSJncmFudGVkIiB0eXBlPSJsb2dpbiI+CiAgICAgICAgPGxvZ2luIHVpZD0iQz1hciwgTz10Lm0ucy4gZ3JvdXAgcy5hLiwgU0VSSUFMTlVNQkVSPUNVSVQgMjcwMzc1NDQ4NjMsIENOPW1pIGNlcnRpZmljYWRvIDEiIHNlcnZpY2U9IndzZmUiIHJlZ21ldGhvZD0iMjIiIGVudGl0eT0iMzM2OTM0NTAyMzkiIGF1dGhtZXRob2Q9ImNtcyI+CiAgICAgICAgICAgIDxyZWxhdGlvbnM+CiAgICAgICAgICAgICAgICA8cmVsYXRpb24gcmVsdHlwZT0iNCIga2V5PSIyNzAzNzU0NDg2MyIvPgogICAgICAgICAgICA8L3JlbGF0aW9ucz4KICAgICAgICA8L2xvZ2luPgogICAgPC9vcGVyYXRpb24+Cjwvc3NvPgoK</Token><Sign>EZezotxeJ5CA8sLamHj5CduPYNvaM++qwBtX1KXQvlrAGMH5DsaIpQMMIjF0ORQ6pa4vbFOxBnNgLrFy+qyXjBdCHYIerbjRzOroY3Ya8k+D9waPtf20AmYUDvs9fFmZU2A6dXVI2rmtZPr0pEi/4KSAfWnOBOM+I6oRnX4+cuc=</Sign><Cuit>27037544863</Cuit></Auth><FeCAEReq><FeCabReq><CantReg>1</CantReg><PtoVta>1</PtoVta><CbteTipo>1</CbteTipo></FeCabReq><FeDetReq><FECAEDetRequest><Concepto>1</Concepto><DocTipo>80</DocTipo><DocNro>23312465019</DocNro><CbteDesde>6</CbteDesde><CbteHasta>6</CbteHasta><CbteFch>20150702</CbteFch><ImpTotal>179.25</ImpTotal><ImpTotConc>2.00</ImpTotConc><ImpNeto>150.00</ImpNeto><ImpOpEx>0.00</ImpOpEx><ImpTrib>1.00</ImpTrib><ImpIVA>26.25</ImpIVA><FchVtoPago></FchVtoPago><MonId>PES</MonId><MonCotiz>1.000</MonCotiz><Tributos><Tributo><Id>99</Id><Desc>Impuesto Municipal Matanza'</Desc><BaseImp>100.00</BaseImp><Alic>0.10</Alic><Importe>0.10</Importe></Tributo><Tributo><Id>4</Id><Desc>Impuestos internos</Desc><BaseImp>100.00</BaseImp><Alic>0.40</Alic><Importe>0.40</Importe></Tributo><Tributo><Id>1</Id><Desc>Impuesto nacional</Desc><BaseImp>50.00</BaseImp><Alic>1.00</Alic><Importe>0.50</Importe></Tributo></Tributos><Iva><AlicIva><Id>5</Id><BaseImp>100.00</BaseImp><Importe>21.00</Importe></AlicIva><AlicIva><Id>4</Id><BaseImp>50.00</BaseImp><Importe>5.25</Importe></AlicIva></Iva><Opcionales><Opcional><Id>5</Id><Valor>02</Valor></Opcional><Opcional><Id>61</Id><Valor>80</Valor></Opcional><Opcional><Id>62</Id><Valor>20267565393</Valor></Opcional><Opcional><Id>7</Id><Valor>01</Valor></Opcional></Opcionales></FECAEDetRequest></FeDetReq></FeCAEReq></FECAESolicitar>
</soap:Body>
</soap:Envelope>